name: "VGG_ILSVRC_16_layers_binary_dress"

layer {
      name: "data"
      type: "Python"
      top: "data"
      top: "label"
      python_param {
      module: "jrlayers2"
      layer: "JrMultilabel"
      param_str: "{\'images_and_labels_file\': \'/home/jeremy/image_dbs/tamara_berg_street_to_shop/dress_filipino_labels_train.txt\', \'mean\': (104.0, 116.7, 122.7),\'augment\':True,\'augment_crop_size\':(224,224), \'batch_size\':70 }"
      }
  include {phase: TRAIN}
}
layer {
      name: "data"
      type: "Python"
      top: "data"
      top: "label"
      python_param {
      module: "jrlayers2"
      layer: "JrMultilabel"
      param_str: "{\'images_and_labels_file\': \'/home/jeremy/image_dbs/tamara_berg_street_to_shop/dress_filipino_labels_test.txt\', \'mean\': (104.0, 116.7, 122.7),\'augment\':True,\'augment_crop_size\':(224,224), \'batch_size\':1 }"
     }
   include {phase: TEST}
}


#layer {
#  name: "data"
#  type: DATA
#  include {
#    phase: TRAIN
#  }
# transform_param {
#    crop_size: 224
#    mean_value: 104
#    mean_value: 117
#    mean_value: 123
#    mirror: true
# }
# data_param {
#    source: "data/ilsvrc12/ilsvrc12_train_lmdb"
#    batch_size: 1
#    backend: LMDB
#  }
#  top: "data"
#  top: "label"
#}

layer {
  bottom: "data"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "relu1_1"
  type: "ReLU"
}

layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "relu1_2"
  type: "ReLU"
}

layer {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "relu3_1"
  type: "ReLU"
}
layer {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "relu3_2"
  type: "ReLU"
}
layer {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "relu3_3"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "pool3"
  name: "pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "relu4_1"
  type: "ReLU"
}
layer {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "relu4_2"
  type: "ReLU"
}
layer {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "relu4_3"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "pool4"
  name: "pool4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "relu5_1"
  type: "ReLU"
}
layer {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}

layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "relu5_2"
  type: "ReLU"
}
layer {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "relu5_3"
  type: "ReLU"
}
layer {
  bottom: "conv5_3"
  top: "pool5"
  name: "pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
####NEW LAYERS FROM HERE
#not anymore
#actually yes due to shape mismatch
layer {
  name: "myfc6"
  bottom: "pool5"
  top: "myfc6"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
  }
  param{
    lr_mult: 10
    decay_mult: 10 }
  param{
    lr_mult: 20
    decay_mult: 0 }
}
layer {
  bottom: "myfc6"
  top: "myfc6"
  name: "relu6"
  type: "ReLU"
}
layer {
  bottom: "myfc6"
  top: "myfc6"
  name: "drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  bottom: "myfc6"
  top: "fc7"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
   }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}
layer {
  bottom: "fc7"
  top: "fc7"
  name: "relu7"
  type: "ReLU"
}
layer {
  bottom: "fc7"
  top: "fc7"
  name: "drop7"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "myfc8"
  bottom: "fc7"
  top: "myfc8"
  type: "InnerProduct"
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  param{
    lr_mult: 1
    decay_mult: 1 }
  param{
    lr_mult: 2
    decay_mult: 0 }
}

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "myfc8"
  bottom: "label"
  top: "loss"
}

layer {
  name: "acc"
  type: "Accuracy"
  bottom: "myfc8"
  bottom: "label"
  top: "accuracy1"
  include: { phase: TEST }
#  accuracy_param {
#    top_k: 1
#  }
}

#layer {
#  name: "accuracy/top5"
#  type: ACCURACY
# bottom: "fc8"
# bottom: "label"
#  top: "accuracy@5"
#  include: { phase: TEST }
#  accuracy_param {
#    top_k: 5
#  }
#}
